// 引用.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;
int main()
{
    //数据类型&引用名 = 原变量名
    int a = 3;
    //long long & ra = a; //不能强制转换，必须是一样的数据类型
    int& ra = a;
    int* const rb = &a;//引用其实就是指针常量的伪装
    //编译时，把int& 替换成 int* const  ；把a替换成&a，字符串的替换

    cout << "a= " << a << "&a=" << &a << endl;//a和ra是同一个，用谁都一样
    cout << "ra= " << ra << "&ra=" << &ra << endl;
    ra = 8;
    cout << "a= " << a << "&a=" << &a << endl;
    cout << "ra= " << ra << "&ra=" << &ra << endl;

    int b = 5;
    ra = b;//ra并不会成为b的别名，只是ra = 5，引用必须初始化，且不会再改变，引用创建时不指定原变量名，则会报错
    cout << "a= " << a << "&a=" << &a << endl;
    cout << "ra= " << ra << "&ra=" << &ra << endl;
    cout << "b= " << b << "&b=" << &b << endl;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
